---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarCouplerError
source: html/36b8947f-6ee1-8f70-f2fc-ab52dd1afd90.htm
---
# Autodesk.Revit.DB.Structure.RebarCouplerError

Error states for the Rebar Coupler

## Syntax (C#)
```csharp
public enum RebarCouplerError
```